
* Org Babel

#+begin_src emacs-lisp

  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("c" . "src c"))

#+end_src

#+begin_src emacs-lisp

(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)
    (python . t)
    (C . t)))

(setq org-confirm-babel-evaluate nil)

#+end_src

#+begin_src C
#include <stdio.h>
#include <limits.h>

void func()
{
  printf("Hello World");
}

int main(void)
{
  func();
  return 0;
}
#+end_src

#+RESULTS:
: Hello World

#+begin_src python
print('Hello World')
#+end_src

#+RESULTS:
: None
